profiling_results/stage-4_wrk_get.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 2.150ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.029ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.13ms    1.99ms  36.77ms   93.31%
    Req/Sec   530.34    150.74     1.89k    79.59%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.67ms
 75.000%    2.25ms
 90.000%    3.32ms
 99.000%   11.59ms
 99.900%   20.58ms
 99.990%   32.43ms
 99.999%   36.80ms
100.000%   36.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.211     0.000000            1         0.00
       0.943     0.100000         5000 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.149     0.200000        10001         0.00
       1.323     0.300000        14999        -0.00
       1.490     0.400000        19992        -0.00
       1.668     0.500000        24990         0.00
       1.764     0.550000        27488 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       1.867     0.600000        29989         0.00
       1.976     0.650000        32482        -0.00
       2.103     0.700000        34997        -0.00
       2.247     0.750000        37479         0.00
       2.339     0.775000        38749 1203947227023143301256189861386337789551427650757181365349027638945094161125536407452473214359529595887917169557085027731865362867515770381017821158220863163008235290230241011428089499786483364104597294698902989176212385163908269767309393920.00
       2.451     0.800000        39992         0.00
       2.589     0.825000        41247        -0.00
       2.761     0.850000        42476        -0.00
       2.985     0.875000        43728         0.00
       3.137     0.887500        44356 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       3.323     0.900000        44976         0.00
       3.557     0.912500        45605        -0.00
       3.855     0.925000        46223        -0.00
       4.307     0.937500        46853         0.00
       4.631     0.943750        47161 1203945637244616785330240268831341603948811067705899837851697832555807222449360856602541611540038955353923748257648793869646399747817805207447884319270693520838748744868345566077786216314830877347789793629591814810548384249633091459666149376.00
       4.975     0.950000        47473         -nan
       5.435     0.956250        47785        -0.00
       5.979     0.962500        48097        -0.00
       6.847     0.968750        48409         0.00
       7.263     0.971875        48566 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
       7.707     0.975000        48724         -nan
       8.319     0.978125        48877        -0.00
       9.007     0.981250        49036        -0.00
       9.639     0.984375        49190         0.00
      10.023     0.985938        49268 1203953586137249364959988231606322531961893982962307475338346864502241915830238610852199625637492158023890854754829963180741215346307631075297568514021541731686181471677822792829302633673093311131827298976147686638868388821008982997882372096.00
      10.583     0.987500        49346         0.00
      11.231     0.989062        49424        -0.00
      11.823     0.990625        49502        -0.00
      12.631     0.992188        49581         0.00
      13.023     0.992969        49619 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      13.575     0.993750        49658         0.00
      14.047     0.994531        49697        -0.00
      14.791     0.995313        49736        -0.00
      15.375     0.996094        49776         0.00
      15.727     0.996484        49795 1203921790566719046440996380506398819909562321936676925391750736716503142306727593853567569247679347344022428766105285936361952952348327603898831735018148888296450564439913885823236964240043575995677277589924199325588370535505416845017481216.00
      16.039     0.996875        49814         -nan
      16.447     0.997266        49835        -0.00
      16.831     0.997656        49853        -0.00
      17.695     0.998047        49873         0.00
      17.935     0.998242        49883 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      18.431     0.998437        49892         -nan
      19.103     0.998633        49902        -0.00
      19.951     0.998828        49912        -0.00
      20.799     0.999023        49922         0.00
      21.327     0.999121        49927 1204047383070313804591014192351097482516272382987917597680805441470171297724596110998164191987439949529502711421567761051660039408487576315923842012081550619685887648029654068497196358500590029783469862065506974213044442763244503148833800192.00
      21.919     0.999219        49931         0.00
      22.719     0.999316        49936        -0.00
      23.647     0.999414        49941        -0.00
      25.023     0.999512        49946         0.00
      26.687     0.999561        49949 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      27.743     0.999609        49951         0.00
      28.383     0.999658        49953        -0.00
      29.263     0.999707        49956        -0.00
      29.743     0.999756        49958         0.00
      30.463     0.999780        49960 1203545013055934771990942944972302832089432138782954908524586622455498676053122042419777701028397540787581580799717860590467693583930581467823800903827943694128139313670693337801358781458404214632299524163175874663220153852288157933568524288.00
      30.527     0.999805        49961         -nan
      31.231     0.999829        49962        -0.00
      31.567     0.999854        49963        -0.00
      32.159     0.999878        49964         0.00
      32.431     0.999890        49965 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      34.015     0.999902        49966         -nan
      34.015     0.999915        49966        -0.00
      34.207     0.999927        49967        -0.00
      34.207     0.999939        49967         0.00
      34.367     0.999945        49968 1205554493113450902391227934487481433796793115602805665149461898514189162739018316733323664864567175755266103287117462435237076882158560860223965336842371396359132651106536260584709089627147475236980875772500272862517309496113538794629627904.00
      34.367     0.999951        49968         0.00
      34.367     0.999957        49968        -0.00
      35.615     0.999963        49969        -0.00
      35.615     0.999969        49969         0.00
      35.615     0.999973        49969 1197515777994123122827113180149268934166040916797761874901295891084783746657345444054174008110143315617531302687800938125050062129397660703838339185309575766350416028682216846776156215216348189439851718800547092882496686463674426196563591168.00
      35.615     0.999976        49969         0.00
      35.615     0.999979        49969        -0.00
      36.799     0.999982        49970        -0.00
      36.799     1.000000        49970         0.00
#[Mean    =        2.133, StdDeviation   =        1.989]
#[Max     =       36.768, Total count    =        49970]
#[Buckets =           19, SubBuckets     =         2048]
----------------------------------------------------------
  59991 requests in 1.00m, 5.05MB read
  Non-2xx or 3xx responses: 2
Requests/sec:    999.81
Transfer/sec:     86.21KB